<?php
// 用循环语句编程打印如下图案:
//
//                    #          $
//                   ##          $$
//                  ###          $$$
//                 ####          $$$$
//                #####          $$$$$
//               ######          $$$$$$
//              #######          $$$$$$$
//             ########          $$$$$$$$
//            #########          $$$$$$$$$
//           ##########          $$$$$$$$$$


for ($i=0; $i <10 ; $i++) {
  // code...
  for ($m=0; $m>$i-10; $m--) {
    // code...
    echo "&nbsp&nbsp";
  }
  for ($m=0; $m <=$i ; $m++) {
    // code...
    echo "#";
  }
  echo "&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp";
    // code...
    for ($n=0; $n <=$i ; $n++) {
      // code...
      echo "$";
    }
    echo "<br>";
}

 ?>
